/*Напишите программу, позволяющую анализировать посещаемость студентов.
Используйте паттерн MVP.
Есть группа студентов. Для каждого студента есть журнал его посещаемости:
список дат занятий и для каждой даты — посетил студент занятие или нет.
Создайте класс AttendanceService (сервис посещаемости),
в котором хранится информация обо всех студентах.
Создайте класс AttendanceView, который позволяет отображать студентов
и их посещаемость.
Создайте класс Presenter со следующими функциями:
• Распечатать всех студентов и посещаемость каждого в процентах;
• Распечатать студентов, отсортировав их по убыванию посещаемости
(вверху самые посещающие);
• Распечатать студентов с посещаемостью ниже 25%.
Проверьте, как это работает.
*/

package OOP.seminar5.hw;

public class Main {
    public static void main(String[] args) {
        //Создаем объект Модель
        AttendanceService model = new AttendanceService("./OOP/seminar5/hw/students_read.txt");
        //System.out.println(model); //вывод модели - дл отладки(тестирования)

        //Создаем объекты View Presenter (MVP)
        AttendanceView view = new AttendanceView ();
        Presenter presenter = new Presenter (model, view);
        presenter.run ();
        
    }
    
}
