/*
 * Дано четное число N (>0) и символы c1 и c2. 
Написать метод, который вернет строку длины N, которая состоит из
 чередующихся символов c1 и c2, начиная с c1

 */
/*package seminar3.lesson;

import java.util.Scanner;

public class task0 {
    public static void main(String[] args) {
        String s1 = "hello";
        String s2 = "hello";
        String s3 = s1;
        String s4 = "h" + "e" + "l" + "l" + "o";
        String s5 = new String("hello");
        String s6 = new String(new char[]{'h', 'e', 'l', 'l', 'o'});
        System.out.println(s1 + "==" + s6 + " = " +  (s1==s6));
        System.out.println(s1 + " eq " + s6 + " = " +  s1.equals(s6));
    }
}
*/