/*
 * Задача 4. Каталог товаров книжного магазина сохранен в виде двумерного списка
 * List<ArrayList<String>> так,
 * что на 0й позиции каждого внутреннего списка содержится название жанра,
 * а на остальных позициях - названия книг. Напишите метод для заполнения данной структуры.


 */
/*package seminar3.lesson;

import java.util.ArrayList;
import java.util.Scanner;

import javax.sound.midi.Soundbank;

public class task4 {
    public static void main(String[] args) {
        ArrayList <ArrayList<String>> ls = new ArrayList<ArrayList<String>>();
        ArrayList<String> ls = new ArrayList<>();
        ls.add("первый");
        ls.add("2");
        ls.add("третий");
        
        ls.add("проза");
        ls.add("поэзия");
        ls.add("док");
        System.out.println(ls);

        for (int i = 0; i< ls.size();i++) {
            Object c = ls.get(i);
            if (c instanceof Integer) {
                ls.remove(i);
            }
        }
        System.out.println(ls);
    }
    
}
*/