package seminar6.lesson;

/*
1. Напишите метод, который заполнит массив из 1000 элементов случайными числами от 0 до 24. 
2. Создайте метод, в который передайте заполненный выше массив, и с помощью Set
вычислите процент уникальных значений в данном массиве, и верните его в виде числа
с плавающей запятой.
Для вычисления процента используйте формулу:
процент уникальных чисел =
        количество уникальных чисел * 100 / общее количество чисел в массиве.
Set<K>

.add
.remove
.contains

 */

 import seminar6.lesson.Cat;

public class task2 {
    /**
     * @param args
     */
    public static void main(String[] args) {
        Cat cat = new Cat("dfg","dfg","dfg");
    }
}
